C = input("Введите исходную ориентацию локатора (С, З, Ю, В): ")
N1 = int(input("Введите первую команду (-1, 1 или 2): "))
N2 = int(input("Введите вторую команду (-1, 1 или 2): "))

# определяем новую ориентацию после первой команды
if N1 == 1:
    if C == "С":
        C = "З"
    elif C == "З":
        C = "Ю"
    elif C == "Ю":
        C = "В"
    elif C == "В":
        C = "С"
elif N1 == -1:
    if C == "С":
        C = "В"
    elif C == "В":
        C = "Ю"
    elif C == "Ю":
        C = "З"
    elif C == "З":
        C = "С"
elif N1 == 2:
    if C == "С":
        C = "Ю"
    elif C == "Ю":
        C = "С"
    elif C == "З":
        C = "В"
    elif C == "В":
        C = "З"

# определяем новую ориентацию после второй команды
if N2 == 1:
    if C == "С":
        C = "З"
    elif C == "З":
        C = "Ю"
    elif C == "Ю":
        C = "В"
    elif C == "В":
        C = "С"
elif N2 == -1:
    if C == "С":
        C = "В"
    elif C == "В":
        C = "Ю"
    elif C == "Ю":
        C = "З"
    elif C == "З":
        C = "С"
elif N2 == 2:
    if C == "С":
        C = "Ю"
    elif C == "Ю":
        C = "С"
    elif C == "З":
        C = "В"
    elif C == "В":
        C = "З"

print("Ориентация локатора после выполнения команд:", C)
