def abc(pr):
    print("Перечень товаров:")
    for p, d in pr.items():
        print(f"Наименование: {p}")
        print(f"Единица измерения: {d['u']}")
        print(f"Цена: {d['pr']} Тг.")
        print(f"Количество: {d['q']}")
        print()

pl = {
    'Яблоки': {
        'u': 'кг',
        'pr': 500,
        'q': 50
    },
    'Молоко': {
        'u': 'л',
        'pr': 420,
        'q': 20
    },
    'Хлеб': {
        'u': 'шт',
        'pr': 150,
        'q': 100
    },
    'Сахар': {
        'u': 'кг',
        'pr': 600,
        'q': 40
    }
}

abc(pl)
