def abc(it):
    print("Информация о наличии:")
    for p, d in it.items():
        print(f"Наименование: {p}")
        print(f"Артикул: {d['ar']}")
        print(f"Дата получения: {d['dr']}")
        print(f"Единица измерения: {d['u']}")
        print(f"Количество: {d['q']}")
        print(f"Цена: {d['pr']} Тг.")
        print()

i = {
    'Яблоки': {
        'ar': '543',
        'dr': '2023.05.01',
        'u': 'кг',
        'q': 100,
        'pr': 500
    },
    'Молоко': {
        'ar': '234',
        'dr': '2023.05.02',
        'u': 'л',
        'q': 50,
        'pr': 400
    },
    'Хлеб': {
        'ar': '321',
        'dr': '2023.05.01',
        'u': 'шт',
        'q': 200,
        'pr': 150
    },
    'Сахар': {
        'ar': '123',
        'dr': '2023.05.02',
        'u': 'кг',
        'q': 120,
        'pr': 600
    }
}

abc(i)
