def abc(b):
    print("Телефонный справочник:")
    for n, d in b.items():
        print(f"Ф.И.О.: {n}")
        print(f"Адрес: {d['ad']}")
        print(f"Номер телефона: {d['pn']}")
        print()

b = {
    'Иван': {
        'ad': 'Астана, ул. Есенберлина, 10',
        'pn': '8 (xxx) xxx xxxx'
    },
    'Петр': {
        'ad': 'Астана, ул. Есенберлина, 20',
        'pn': '8 (xxx) xxx xxxx'
    },
    'Игорь': {
        'ad': 'Астана, ул. Есенберлина, 5',
        'pn': '8 (xxx) xxx xxxx'
    },
}

abc(b)
