def abc(a):
    print("График отпусков:")
    for n, d in a.items():
        print(f"Ф.И.О.: {n}")
        print(f"Дата начала отпуска: {d['sd']}")
        print(f"Дата выхода на работу: {d['rd']}")
        print(f"Количество дней: {d['dt']}")
        print()

s = {
    'Иван': {
        'sd': '2023.07.01',
        'rd': '2023.07.10',
        'dt': 10
    },
    'Петр': {
        'sd': '2023.08.15',
        'rd': '2023.08.25',
        'dt': 11
    },
    'Игорь': {
        'sd': '2023.06.10',
        'rd': '2023.06.20',
        'dt': 11
    },
}

abc(s)
